{
    "train": {
        "text": [
            "Lavar y guardar la ropa de esta semana.",
            "Investigar nuevas herramientas de inteligencia artificial para automatización.",
            "Preparar la presentación para la reunión del viernes.",
            "Limpiar y organizar la cocina, incluyendo el refrigerador.",
            "No olvidar comprar detergente para lavar la ropa.",
            "Preparar la presentación del proyecto de investigación para la próxima semana.",
            "Cita con el dentista el jueves a las 10:00 a.m.",
            "Comprar una botella de agua para llevar al trabajo.",
            "Añadir huevos a la lista de compras.",
            "Programar una reunión con el equipo para revisar avances.",
            "Actualizar el informe semanal de progreso del proyecto.",
            "Repasar las notas de la última clase de matemáticas.",
            "Organizar los archivos del proyecto en la carpeta compartida.",
            "Reunión con el cliente para revisar el proyecto el lunes a las 3:00 p.m.",
            "Cita con el mecánico para el mantenimiento del auto el martes a las 9:00 a.m.",
            "Buscar artículos académicos para la bibliografía de la tesis.",
            "Leer el capítulo 5 del libro de historia antes del jueves.",
            "Desempolvar los muebles de la sala y las habitaciones.",
            "Aspirar y barrer el piso de toda la casa.",
            "Asistir a la sesión de estudio grupal el martes a las 4:00 p.m.",
            "Cita de revisión médica el viernes a las 8:00 a.m.",
            "Terminar el ensayo de literatura y revisarlo antes de entregarlo.",
            "Reservar entradas para la obra de teatro antes del fin de semana.",
            "Recordar ver el documental sobre cambio climático el viernes.",
            "Recordar comprar leche para el desayuno de mañana.",
            "Revisar si hay suficiente pasta de dientes; comprar si hace falta.",
            "El aniversario de bodas de Luis y Ana es el 20 de marzo.",
            "Organizar las notas de clase y hacer un resumen de los temas principales.",
            "Pasar por el supermercado y comprar frutas frescas.",
            "Llamar al banco para la asesoría financiera el miércoles por la mañana.",
            "Necesito comprar pan integral para la semana.",
            "Regar las plantas de la sala y el balcón.",
            "Hacer una cita con el oftalmólogo para la revisión anual.",
            "Comprar una nueva libreta para las notas de la universidad.",
            "Limpiar el garaje y organizar las herramientas el sábado.",
            "Actualizar el currículum antes de la reunión de networking del jueves.",
            "Reservar un restaurante para celebrar el aniversario de mis padres.",
            "No olvidar comprar protector solar para las vacaciones.",
            "Leer el artículo sobre redes neuronales publicado en la última revista de AI.",
            "Organizar el escritorio y archivar documentos importantes.",
            "Comprar boletos de tren para el viaje a la ciudad la próxima semana.",
            "Revisar los ejercicios de álgebra antes de la clase del lunes.",
            "Enviar el correo de seguimiento al cliente después de la reunión.",
            "Cita para la vacuna de refuerzo el martes por la mañana.",
            "Buscar recetas nuevas para cocinar el fin de semana.",
            "Recordar regar las plantas en el jardín dos veces por semana.",
            "Organizar el itinerario de viaje y revisar las reservas de hotel.",
            "Comprar pilas para el control remoto de la tele.",
            "Leer el capítulo sobre algoritmos de clasificación para la clase de AI.",
            "Reunión con el equipo de desarrollo para definir el roadmap del proyecto.",
            "Llamar al veterinario para la consulta anual de la mascota.",
            "Terminar el resumen de la novela para la clase de literatura.",
            "Agendar cita para revisión médica anual.",
            "Comprar cartuchos de tinta para la impresora de casa.",
            "Limpiar el auto y aspirar los asientos el fin de semana.",
            "Revisar el informe de ventas mensual antes del jueves.",
            "No olvidar reservar boletos para el concierto del sábado.",
            "Actualizar el software en la computadora de la oficina.",
            "Leer el artículo sobre aprendizaje automático para el proyecto final.",
            "Organizar el armario y donar ropa que ya no uso.",
            "Comprar un regalo para el cumpleaños de Juan.",
            "Revisar y firmar los documentos para la solicitud de préstamo.",
            "Estudiar el tema de estadística para el examen de la próxima semana.",
            "Agendar una llamada con el equipo de desarrollo el martes.",
            "Cita con el fisioterapeuta el miércoles a las 5:00 p.m.",
            "Limpiar las ventanas de la sala y el comedor.",
            "Recordar cargar el teléfono antes de salir de casa.",
            "Comprar una lámpara nueva para el escritorio.",
            "Leer el capítulo de teoría de conjuntos para la clase de matemáticas.",
            "Reunión con el jefe de proyectos el lunes a las 9:00 a.m.",
            "Programar cita con el dermatólogo para revisión de lunares.",
            "Estudiar los apuntes de química antes de la práctica de laboratorio.",
            "Comprar ingredientes para hacer una pizza casera el viernes.",
            "Hacer una copia de seguridad de los archivos importantes en la nube.",
            "Buscar y comprar un libro sobre procesamiento de lenguaje natural.",
            "Recordar enviar el reporte mensual antes de fin de mes.",
            "Asistir al webinar sobre tendencias en inteligencia artificial.",
            "Regar las plantas de la terraza en la mañana.",
            "Cita de revisión dental para limpieza el jueves a las 11:00 a.m.",
            "Comprar repelente de mosquitos para el viaje al campo.",
            "Preparar la presentación para la reunión trimestral de resultados.",
            "Leer el artículo sobre redes neuronales en el blog de AI.",
            "Organizar la despensa y verificar las fechas de caducidad.",
            "Llamar a mi hermana para felicitarla por su nuevo trabajo.",
            "Enviar la propuesta de colaboración a la empresa asociada.",
            "Actualizar la hoja de vida con los últimos proyectos completados.",
            "Agendar cita con el técnico para reparar la lavadora.",
            "No olvidar llevar el paraguas; hay pronóstico de lluvia.",
            "Revisar los ejercicios de cálculo para la tarea de mañana.",
            "Limpiar y organizar el jardín el domingo en la mañana.",
            "Comprar vitaminas y suplementos para el mes.",
            "Preparar el resumen del capítulo para la discusión en clase.",
            "Asistir a la sesión de brainstorming con el equipo de marketing.",
            "Llamar al seguro para revisar los beneficios de salud.",
            "Comprar materiales de papelería para el nuevo proyecto.",
            "Leer los artículos recomendados sobre ética en inteligencia artificial.",
            "Revisar las cuentas bancarias y hacer una transferencia a ahorros.",
            "Enviar recordatorio de pago a los clientes pendientes.",
            "Llamar al banco para preguntar sobre opciones de inversión.",
            "Hacer una lista de tareas pendientes para la próxima semana.",
            "Organizar los libros y papeles en la oficina.",
            "Actualizar el reporte semanal con los últimos datos de rendimiento.",
            "Reparar el grifo del baño que gotea desde hace días.",
            "Planificar el menú de comidas para la semana."
        ],
        "label": [
            5,
            2,
            2,
            5,
            1,
            4,
            0,
            1,
            1,
            2,
            2,
            4,
            2,
            0,
            0,
            4,
            4,
            5,
            5,
            4,
            0,
            4,
            3,
            3,
            1,
            1,
            3,
            4,
            1,
            0,
            1,
            5,
            0,
            1,
            5,
            2,
            0,
            1,
            4,
            5,
            1,
            4,
            2,
            0,
            5,
            3,
            5,
            1,
            4,
            2,
            0,
            4,
            0,
            1,
            5,
            2,
            3,
            2,
            4,
            5,
            1,
            2,
            4,
            2,
            0,
            5,
            3,
            1,
            4,
            2,
            0,
            4,
            1,
            2,
            1,
            3,
            4,
            5,
            0,
            1,
            2,
            4,
            5,
            3,
            2,
            2,
            0,
            3,
            4,
            5,
            1,
            4,
            2,
            0,
            1,
            4,
            3,
            2,
            3,
            3,
            5,
            2,
            5,
            5
        ],
        "label_text": [
            "hogar",
            "trabajo",
            "trabajo",
            "hogar",
            "comprar",
            "estudios",
            "cita",
            "comprar",
            "comprar",
            "trabajo",
            "trabajo",
            "estudios",
            "trabajo",
            "cita",
            "cita",
            "estudios",
            "estudios",
            "hogar",
            "hogar",
            "estudios",
            "cita",
            "estudios",
            "recordatorio",
            "recordatorio",
            "comprar",
            "comprar",
            "recordatorio",
            "estudios",
            "comprar",
            "cita",
            "comprar",
            "hogar",
            "cita",
            "comprar",
            "hogar",
            "trabajo",
            "cita",
            "comprar",
            "estudios",
            "hogar",
            "comprar",
            "estudios",
            "trabajo",
            "cita",
            "hogar",
            "recordatorio",
            "hogar",
            "comprar",
            "estudios",
            "trabajo",
            "cita",
            "estudios",
            "cita",
            "comprar",
            "hogar",
            "trabajo",
            "recordatorio",
            "trabajo",
            "estudios",
            "hogar",
            "comprar",
            "trabajo",
            "estudios",
            "trabajo",
            "cita",
            "hogar",
            "recordatorio",
            "comprar",
            "estudios",
            "trabajo",
            "cita",
            "estudios",
            "comprar",
            "trabajo",
            "comprar",
            "recordatorio",
            "estudios",
            "hogar",
            "cita",
            "comprar",
            "trabajo",
            "estudios",
            "hogar",
            "recordatorio",
            "trabajo",
            "trabajo",
            "cita",
            "recordatorio",
            "estudios",
            "hogar",
            "comprar",
            "estudios",
            "trabajo",
            "cita",
            "comprar",
            "estudios",
            "recordatorio",
            "trabajo",
            "recordatorio",
            "recordatorio",
            "hogar",
            "trabajo",
            "hogar",
            "hogar"
        ]
    },
    "test": {
        "text": [
            "El cumpleaños de mamá es el 12 de diciembre.",
            "Encuentro con amigos para cenar el sábado a las 7:00 p.m.",
            "Realizar los ejercicios de práctica de química para el viernes.",
            "No olvidar la exposición de arte contemporáneo el 5 de mayo.",
            "Comenzar a leer el libro de Gabriel García Márquez que recomendó Carla.",
            "Lavar los platos y limpiar las superficies de la cocina.",
            "Sacar la basura y colocar nuevas bolsas en los contenedores.",
            "Organizar el clóset y separar la ropa para donar.",
            "Videollamada con el equipo de trabajo el miércoles a las 2:00 p.m.",
            "Terminar la documentación del nuevo sistema implementado.",
            "Llamar a Juan para felicitarlo por su promoción.",
            "Enviar un mensaje de felicitación a Pedro por su graduación.",
            "Comprar café, que ya casi se termina el que tengo en casa.",
            "Revisar y corregir el código del modelo antes del despliegue.",
            "Revisar y responder los correos pendientes antes del mediodía.",
            "Cita para ver el apartamento en renta el jueves a las 5:30 p.m."
        ],
        "label": [
            3,
            0,
            4,
            3,
            3,
            5,
            5,
            5,
            0,
            2,
            3,
            3,
            1,
            2,
            2,
            0
        ],
        "label_text": [
            "recordatorio",
            "cita",
            "estudios",
            "recordatorio",
            "recordatorio",
            "hogar",
            "hogar",
            "hogar",
            "cita",
            "trabajo",
            "recordatorio",
            "recordatorio",
            "comprar",
            "trabajo",
            "trabajo",
            "cita"
        ]
    }
}